app/Controllers/AuthController.php

SELECT *
FROM `admin`
---
    public function dashboard(){
        $userModel = new UserModel();

        // Fetch all products from the database
        $data['admin'] = $userModel->findAll();